In [1]:
import pandas as a

df = a.DataFrame({
    'country': ['india', 'US', 'japan', 'US', 'japan'],
    'age': [44, 34, 46, 35, 23],
    'salary': [72000, 65000, 98000, 45000, 34000]
})
df

  country  age  salary
0   india   44   72000
1      US   34   65000
2   japan   46   98000
3      US   35   45000
4   japan   23   34000

In [3]:
from sklearn.preprocessing import LabelEncoder
label_encoder = LabelEncoder()
df['country'] = label_encoder.fit_transform(df['country'])
df

   country  age  salary
0        1   44   72000
1        0   34   65000
2        2   46   98000
3        0   35   45000
4        2   23   34000

In [4]:
label_encoder.classes_

array(['US', 'india', 'japan'], dtype=object)

In [5]:
df = a.DataFrame({
    'country': ['india', 'US', 'japan', 'US', 'japan'],
    'age': [44, 34, 46, 35, 23],
    'salary': [72000, 65000, 98000, 45000, 34000]
})
df

  country  age  salary
0   india   44   72000
1      US   34   65000
2   japan   46   98000
3      US   35   45000
4   japan   23   34000

In [6]:
x = df['country'].values.reshape(-1, 1)
x

array([['india'],
       ['US'],
       ['japan'],
       ['US'],
       ['japan']], dtype=object)

In [7]:
from sklearn.preprocessing import OneHotEncoder
onehot_encoder = OneHotEncoder()
x = onehot_encoder.fit_transform(x).toarray()
x

array([[0., 1., 0.],
       [1., 0., 0.],
       [0., 0., 1.],
       [1., 0., 0.],
       [0., 0., 1.]])

In [8]:
onehot_encoder.categories_

[array(['US', 'india', 'japan'], dtype=object)]

In [9]:
df_oneshot = a.DataFrame(x, columns = [str(i) for i in range(x.shape[1])])
df_oneshot

     0    1    2
0  0.0  1.0  0.0
1  1.0  0.0  0.0
2  0.0  0.0  1.0
3  1.0  0.0  0.0
4  0.0  0.0  1.0

In [10]:
df = a.concat([df_oneshot, df], axis = 1)
df

     0    1    2 country  age  salary
0  0.0  1.0  0.0   india   44   72000
1  1.0  0.0  0.0      US   34   65000
2  0.0  0.0  1.0   japan   46   98000
3  1.0  0.0  0.0      US   35   45000
4  0.0  0.0  1.0   japan   23   34000

In [11]:
df = df.drop(['country'], axis = 1)
df

     0    1    2  age  salary
0  0.0  1.0  0.0   44   72000
1  1.0  0.0  0.0   34   65000
2  0.0  0.0  1.0   46   98000
3  1.0  0.0  0.0   35   45000
4  0.0  0.0  1.0   23   34000